recept/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Покупатели</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерБП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзБП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.Партии</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/AccumulationRegisters/ОстаткиМатериалов/ОстаткиМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериалов</name>
  <resources>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ВыпускПродукции</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Включаем запись и автоматическую блокировку измерений регистра
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.ОстаткиМатериалов.БлокироватьДляИзменения = Истина;
	
	// 1. Формируем движения документа
	Для Каждого ТекСтрока Из Товары Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		
		Движение.Наименование = ТекСтрока.Номенклатура;
		Движение.Характеристики = ТекСтрока.Характеристика;
		Движение.Партия = ТекСтрока.Партия;
		Движение.Остаток = ТекСтрока.Количество;
		Движение.Сумма = ТекСтрока.Сумма;
	КонецЦикла;
	
	// 2. Записываем движения (Именно здесь платформа физически пишет данные и ставит блокировки)
	Движения.Записать();
	
	// 3. Контроль остатков.
	// Имеет смысл делать контроль только при оперативном проведении (в реальном времени).
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОстаткиМатериаловОстатки.Наименование.Наименование КАК Товар,
			|	ОстаткиМатериаловОстатки.Характеристики.Наименование КАК Характеристика,
			|	ОстаткиМатериаловОстатки.Партия.Наименование КАК Партия,
			|	-ОстаткиМатериаловОстатки.ОстатокОстаток КАК Дефицит
			|ИЗ
			|	РегистрНакопления.ОстаткиМатериалов.Остатки(
			|		&ГраницаКонтроля,
			|		(Наименование, Характеристики, Партия) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				Т.Номенклатура,
			|				Т.Характеристика,
			|				Т.Партия
			|			ИЗ
			|				Документ.РеализацияТоваровУслуг.Товары КАК Т
			|			ГДЕ
			|				Т.Ссылка = &Ссылка)
			|	) КАК ОстаткиМатериаловОстатки
			|ГДЕ
			|	ОстаткиМатериаловОстатки.ОстатокОстаток < 0";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		// Граница "Включая" гарантирует, что мы видим остаток с учетом только что записанных движений этого документа
		Запрос.УстановитьПараметр("ГраницаКонтроля", Новый Граница(МоментВремени(), ВидГраницы.Включая));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		// Если запрос вернул хотя бы одну строку — мы ушли в минус
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Отказ = Истина; // Отменяем проведение
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не хватает товара: " + Выборка.Товар + 
								  " (" + Выборка.Характеристика + "), партия " + Выборка.Партия + 
								  ". Нехватка: " + Выборка.Дефицит;
				Сообщение.Сообщить();
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры




Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Контрагент;
		ЗаказКлиента = ДанныеЗаполнения.Ссылка;
		Ответственный = ДанныеЗаполнения.Ответственный;
		ВсегоСумма = ДанныеЗаполнения.СуммаДокумента;
		Комментарий = ДанныеЗаполнения.Комментарий;

		Для Каждого ТекСтрокаТовары из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Характеристика = ТекСтрокаТовары.Характеристика;
			НоваяСтрока.Партия = ТекСтрокаТовары.Партия;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
